IDENTIFICATION DIVISION.
	PROGRAM-ID. AOC-2020-DAY-01.

ENVIRONMENT DIVISION.
	INPUT-OUTPUT SECTION.
	FILE-CONTROL.
		SELECT InputFile ASSIGN TO "input.txt"
			ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
	FILE SECTION.
	FD InputFile.
	01 INPUT-FILE.
		05 INPUT-LINE PIC 9(4).
	
	WORKING-STORAGE SECTION.
	01 WS-EOF PIC 9(1) VALUE 0.
	01 WS-INPUT.
		05 WS-INPUT-LINE PIC 9(16).
	01 WS-REPORT-ENTRIES.
		05 WS-ENTRY OCCURS 200 TIMES.
			10 WS-VALUE PIC 9(16).
	01 WS-INDEX-I PIC 9(8).
	01 WS-INDEX-J PIC 9(8).
	01 WS-INDEX-K PIC 9(8).
	01 WS-ACCUMULATOR PIC 9(16) VALUE 0.
	01 WS-FORMATTED-NUMBER PIC ZZZZZZZZZZ.
	01 WS-TEMP-A PIC 9(16).
	01 WS-TEMP-B PIC 9(16).
	01 WS-TEMP-C PIC 9(16).

PROCEDURE DIVISION.
	
	OPEN INPUT InputFile.
		PERFORM VARYING WS-INDEX-I FROM 1 BY 1 UNTIL WS-EOF=1
			READ InputFile INTO WS-INPUT-LINE
				AT END MOVE 1 TO WS-EOF
				NOT AT END
					MOVE WS-INPUT-LINE TO WS-ENTRY (WS-INDEX-I)
			END-READ
		END-PERFORM.
	CLOSE InputFile.
	
	PERFORM VARYING WS-INDEX-I FROM 1 BY 1 UNTIL WS-INDEX-I>200
		PERFORM VARYING WS-INDEX-J FROM 1 BY 1 UNTIL WS-INDEX-J>200
			MOVE WS-ENTRY (WS-INDEX-I) TO WS-TEMP-A
			MOVE WS-ENTRY (WS-INDEX-J) TO WS-TEMP-B
			ADD WS-TEMP-A TO WS-TEMP-B GIVING WS-ACCUMULATOR
			IF WS-ACCUMULATOR=2020 THEN
				MULTIPLY WS-TEMP-A BY WS-TEMP-B GIVING WS-ACCUMULATOR
				MOVE WS-ACCUMULATOR TO WS-FORMATTED-NUMBER
				DISPLAY "Part 1 answer: " WS-FORMATTED-NUMBER
				NEXT SENTENCE
		END-PERFORM
	END-PERFORM.
	
	PERFORM VARYING WS-INDEX-I FROM 1 BY 1 UNTIL WS-INDEX-I>200
		PERFORM VARYING WS-INDEX-J FROM 1 BY 1 UNTIL WS-INDEX-J>200
			PERFORM VARYING WS-INDEX-K FROM 1 BY 1 UNTIL WS-INDEX-K>200
				MOVE WS-ENTRY (WS-INDEX-I) TO WS-TEMP-A
				MOVE WS-ENTRY (WS-INDEX-J) TO WS-TEMP-B
				MOVE WS-ENTRY (WS-INDEX-K) TO WS-TEMP-C
				ADD WS-TEMP-A TO WS-TEMP-B GIVING WS-ACCUMULATOR
				ADD WS-TEMP-C TO WS-ACCUMULATOR
				IF WS-ACCUMULATOR=2020 THEN
					MULTIPLY WS-TEMP-A BY WS-TEMP-B GIVING WS-ACCUMULATOR
					MULTIPLY WS-TEMP-C BY WS-ACCUMULATOR
					MOVE WS-ACCUMULATOR TO WS-FORMATTED-NUMBER
					DISPLAY "Part 2 answer: " WS-FORMATTED-NUMBER
					NEXT SENTENCE
			END-PERFORM
		END-PERFORM
	END-PERFORM.
	
STOP RUN.
