IDENTIFICATION DIVISION.
	PROGRAM-ID. AOC-2020-DAY-00.

ENVIRONMENT DIVISION.
	INPUT-OUTPUT SECTION.
	FILE-CONTROL.
		SELECT InputFile ASSIGN TO "input.txt"
			ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
	FILE SECTION.
	FD InputFile.
	01 INPUT-FILE.
		05 INPUT-LINE PIC X(80).
	
	WORKING-STORAGE SECTION.
	01 WS-EOF PIC 9(1) VALUE 0.
	01 WS-INPUT.
		05 WS-INPUT-LINE OCCURS 1300 TIMES INDEXED BY I.
			10 WS-PASSPORT-LINE PIC X(80).
		05 WS-LINE-COUNT PIC 9(8).
	01 WS-CURRENT-LINE PIC 9(9) VALUE 1.
	01 WS-PASSPORT-STRING PIC X(100).
	01 WS-STRING-LENGTH PIC 9(8).
	01 WS-LINE-LENGTH PIC 9(8).
	01 WS-FIELDS.
		05 WS-FIELD OCCURS 8 TIMES INDEXED BY J.
			10 WS-FIELD-VALUE PIC X(15).
	01 WS-FIELDS-TALLY PIC 9(4).
	01 WS-FIELDS-COUNT PIC 9(4).
	01 WS-REQUIRED-FIELDS PIC A(30) VALUE "byr iyr eyr hgt hcl ecl pid".
	01 WS-PASSPORT-FIELDS-VALID PIC 9(1).
	01 WS-PASSPORT-DATA-VALID PIC 9(1).
	01 WS-ALL-FIELDS-COUNT PIC 9(8) VALUE 0.
	01 WS-FORMATTED-NUMBER PIC ZZZZ.

PROCEDURE DIVISION.
	
	OPEN INPUT InputFile.
		PERFORM VARYING I FROM 1 BY 1 UNTIL WS-EOF=1
			READ InputFile INTO WS-INPUT-LINE(I)
				AT END
					SET I TO 1
					MOVE 1 TO WS-EOF
				NOT AT END
					MOVE I TO WS-LINE-COUNT
			END-READ
		END-PERFORM.
	CLOSE InputFile.
	
	PERFORM UNTIL I>WS-LINE-COUNT
		PERFORM READ-PASS-STRING-PARA
		PERFORM FILL-PASS-FIELDS-PARA
		PERFORM CHECK-REQUIRED-FIELDS-PARA
		IF WS-PASSPORT-FIELDS-VALID=1
			ADD 1 TO WS-ALL-FIELDS-COUNT
		END-IF
	END-PERFORM.
	
	MOVE WS-ALL-FIELDS-COUNT TO WS-FORMATTED-NUMBER.
	DISPLAY "Part 1 answer: "WS-FORMATTED-NUMBER.
	
	STOP RUN.
	
	READ-PASS-STRING-PARA.
	MOVE WS-INPUT-LINE(I) TO WS-PASSPORT-STRING.
	SET I UP BY 1.
	PERFORM VARYING I FROM I BY 1 UNTIL WS-INPUT-LINE(I)=SPACES
		STRING
			FUNCTION TRIM(WS-PASSPORT-STRING); SPACE;
			FUNCTION TRIM(WS-INPUT-LINE(I));
			INTO WS-PASSPORT-STRING
		END-STRING
	END-PERFORM.
	SET I UP BY 1.
	
	FILL-PASS-FIELDS-PARA.
	PERFORM VARYING J FROM 1 BY 1 UNTIL J>8
		MOVE SPACES TO WS-FIELD(J)
	END-PERFORM.
	MOVE 0 TO WS-FIELDS-TALLY.
	UNSTRING WS-PASSPORT-STRING DELIMITED BY ALL SPACES
		INTO WS-FIELD(1)
		     WS-FIELD(2)
		     WS-FIELD(3)
		     WS-FIELD(4)
		     WS-FIELD(5)
		     WS-FIELD(6)
		     WS-FIELD(7)
		     WS-FIELD(8)
		TALLYING WS-FIELDS-TALLY
	END-UNSTRING.
	
	CHECK-REQUIRED-FIELDS-PARA.
	MOVE 0 TO WS-PASSPORT-FIELDS-VALID.
	MOVE 0 TO WS-FIELDS-COUNT.
	PERFORM VARYING J FROM 1 BY 1 UNTIL J>WS-FIELDS-TALLY
		INSPECT WS-REQUIRED-FIELDS TALLYING WS-FIELDS-COUNT FOR ALL WS-FIELD(J)(1:3)
	END-PERFORM.
	IF WS-FIELDS-COUNT=7
		MOVE 1 TO WS-PASSPORT-FIELDS-VALID
	END-IF.
