IDENTIFICATION DIVISION.
	PROGRAM-ID. AOC-2020-DAY-05.

ENVIRONMENT DIVISION.
	INPUT-OUTPUT SECTION.
	FILE-CONTROL.
		SELECT InputFile ASSIGN TO "input.txt"
			ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
	FILE SECTION.
	FD InputFile.
	01 INPUT-FILE.
		05 INPUT-LINE PIC A(10).
	
	WORKING-STORAGE SECTION.
	01 WS-EOF PIC 9(1) VALUE 0.
	01 WS-INPUT.
		05 WS-INPUT-LINE PIC X(10).
	01 WS-SEATS.
		05 WS-SEAT OCCURS 900 TIMES INDEXED BY I.
			10 WS-SEAT-ROW PIC X(7).
			10 WS-SEAT-COL PIC X(3).
		05 WS-ID-COUNT PIC 9(4).
	01 WS-IDS.
		05 WS-ID OCCURS 900 TIMES INDEXED BY J.
			10 WS-ID-VALUE PIC 9(10) VALUE 0.
	01 WS-BIT PIC 9(1).
	01 WS-TEMP PIC 9(4).
	01 WS-BIT-INDEX PIC 9(4).
	01 WS-CHAR-INDEX PIC 9(4).
	01 WS-MAX-ID PIC 9(4) VALUE 0.
	01 WS-SEAT-FOUND PIC 9(1) VALUE 0.
	01 WS-SEAT-EXISTS PIC 9(1).
	01 WS-PREV-SEAT-EXISTS PIC 9(1).
	01 WS-FORMATTED-NUMBER PIC ZZZZ.

PROCEDURE DIVISION.
	
	OPEN INPUT InputFile.
		PERFORM VARYING I FROM 1 BY 1 UNTIL WS-EOF=1
			READ InputFile INTO WS-INPUT-LINE
				AT END
					MOVE 1 TO WS-EOF
				NOT AT END
					INSPECT WS-INPUT-LINE REPLACING ALL "F" BY "0"
					INSPECT WS-INPUT-LINE REPLACING ALL "B" BY "1"
					INSPECT WS-INPUT-LINE REPLACING ALL "L" BY "0"
					INSPECT WS-INPUT-LINE REPLACING ALL "R" BY "1"
					MOVE WS-INPUT-LINE TO WS-SEAT(I)
					MOVE I TO WS-ID-COUNT
			END-READ
		END-PERFORM.
	CLOSE InputFile.
	
	PERFORM CONVERT-SEAT-ID-PARA VARYING J FROM 1 BY 1 UNTIL J>WS-ID-COUNT.
	
	PERFORM VARYING J FROM 1 BY 1 UNTIL J>WS-ID-COUNT
		IF WS-ID-VALUE(J)>WS-MAX-ID
			MOVE WS-ID-VALUE(J) TO WS-MAX-ID
		END-IF
	END-PERFORM.
	MOVE WS-MAX-ID TO WS-FORMATTED-NUMBER.
	DISPLAY "Part 1 answer: " WS-FORMATTED-NUMBER.
	
	PERFORM VARYING I FROM 1 BY 1 UNTIL WS-SEAT-FOUND=1
		PERFORM CHECK-SEAT-EXISTS-PARA
		IF WS-SEAT-EXISTS=0 AND WS-PREV-SEAT-EXISTS=1
			MOVE 1 TO WS-SEAT-FOUND
		END-IF
		MOVE WS-SEAT-EXISTS TO WS-PREV-SEAT-EXISTS
	END-PERFORM.
	SET I DOWN BY 1.
	MOVE I TO WS-FORMATTED-NUMBER.
	DISPLAY "Part 2 answer: " WS-FORMATTED-NUMBER.
	
	STOP RUN.
	
	CONVERT-SEAT-ID-PARA.
	PERFORM VARYING WS-CHAR-INDEX FROM 1 BY 1 UNTIL WS-CHAR-INDEX>10
		COMPUTE WS-BIT-INDEX=(10)-(WS-CHAR-INDEX)
		MOVE WS-SEAT(J)(WS-CHAR-INDEX:1) TO WS-BIT
		COMPUTE WS-TEMP=(WS-BIT)*((2)**(WS-BIT-INDEX))
		ADD WS-TEMP TO WS-ID-VALUE(J)
	END-PERFORM.
	
	CHECK-SEAT-EXISTS-PARA.
	MOVE 0 TO WS-SEAT-EXISTS.
	PERFORM VARYING J FROM 1 BY 1 UNTIL J>WS-ID-COUNT
		IF WS-ID-VALUE(J)=I
			MOVE 1 TO WS-SEAT-EXISTS
		END-IF
	END-PERFORM.
