IDENTIFICATION DIVISION.
	PROGRAM-ID. AOC-2020-DAY-02.

ENVIRONMENT DIVISION.
	INPUT-OUTPUT SECTION.
	FILE-CONTROL.
		SELECT InputFile ASSIGN TO "input.txt"
			ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
	FILE SECTION.
	FD InputFile.
	01 INPUT-FILE.
		05 INPUT-LINE PIC X(30).
	
	WORKING-STORAGE SECTION.
	01 WS-EOF PIC 9(1) VALUE 0.
	01 WS-INPUT.
		05 WS-INPUT-LINE PIC X(30).
	01 WS-POLICIES-DB.
		05 WS-ENTRY OCCURS 1000 TIMES INDEXED BY I.
			10 WS-POLICY PIC X(30).
	01 WS-PW-COUNT-VALID PIC 9(8) VALUE 0.
	01 WS-PW-POSIT-VALID PIC 9(8) VALUE 0.
	01 WS-POLICY-DATA.
		05 WS-RANGE PIC X(5).
		05 WS-LETTER PIC A(1).
		05 WS-PASSWORD PIC A(30).
	01 WS-RANGE-DATA.
		05 WS-RANGE-MIN PIC 9(4).
		05 WS-RANGE-MAX PIC 9(4).
	01 WS-FORMATTED-NUMBER PIC ZZZZZ.
	01 WS-LETTER-COUNT PIC 9(4).
	01 WS-POSIT-COUNT PIC 9(4).

PROCEDURE DIVISION.
	
	OPEN INPUT InputFile.
		PERFORM VARYING I FROM 1 BY 1 UNTIL WS-EOF=1
			READ InputFile INTO WS-INPUT
				AT END
					MOVE 1 TO WS-EOF
				NOT AT END
					MOVE WS-INPUT-LINE TO WS-ENTRY(I)
			END-READ
		END-PERFORM.
	CLOSE InputFile.
	
	PERFORM VARYING I FROM 1 BY 1 UNTIL I>1000
		UNSTRING WS-ENTRY(I) DELIMITED BY SPACE
			INTO WS-RANGE, WS-LETTER, WS-PASSWORD
		END-UNSTRING
		UNSTRING WS-RANGE DELIMITED BY "-"
			INTO WS-RANGE-MIN, WS-RANGE-MAX
		END-UNSTRING
		MOVE 0 TO WS-LETTER-COUNT
		INSPECT WS-PASSWORD TALLYING WS-LETTER-COUNT FOR ALL WS-LETTER
		IF WS-LETTER-COUNT>=WS-RANGE-MIN AND WS-LETTER-COUNT<=WS-RANGE-MAX THEN
			ADD 1 TO WS-PW-COUNT-VALID
		END-IF
		MOVE 0 TO WS-POSIT-COUNT
		IF WS-PASSWORD(WS-RANGE-MIN:1)=WS-LETTER THEN
			ADD 1 TO WS-POSIT-COUNT
		END-IF
		IF WS-PASSWORD(WS-RANGE-MAX:1)=WS-LETTER THEN
			ADD 1 TO WS-POSIT-COUNT
		END-IF
		IF WS-POSIT-COUNT=1 THEN
			ADD 1 TO WS-PW-POSIT-VALID
		END-IF
	END-PERFORM.
	
	MOVE WS-PW-COUNT-VALID TO WS-FORMATTED-NUMBER.
	DISPLAY "Part 1 answer: " WS-FORMATTED-NUMBER.
	MOVE WS-PW-POSIT-VALID TO WS-FORMATTED-NUMBER.
	DISPLAY "Part 2 answer: " WS-FORMATTED-NUMBER.
	
STOP RUN.
