IDENTIFICATION DIVISION.
	PROGRAM-ID. AOC-2020-DAY-13.

ENVIRONMENT DIVISION.
	INPUT-OUTPUT SECTION.
	FILE-CONTROL.
		SELECT InputFile ASSIGN TO "input.txt"
			ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
	FILE SECTION.
	FD InputFile.
	01 INPUT-FILE.
		05 INPUT-LINE PIC X(200).
	
	WORKING-STORAGE SECTION.
	01 WS-INPUT.
		05 WS-INPUT-LINE PIC X(250).
	01 WS-DATA.
		05 WS-START-TIME PIC 9(8).
		05 WS-SCHEDULE PIC X(250).
	01 WS-BUSSES.
		05 WS-BUS OCCURS 100 TIMES INDEXED BY I.
			10 WS-BUS-ID PIC X(3).
		05 WS-BUS-COUNT PIC 9(4).
		05 WS-CURRENT-BUS PIC 9(3).
	01 WS-WAIT-TIMES.
		05 WS-WAIT-TIME OCCURS 100 TIMES.
			10 WS-TIME PIC 9(8).
		05 WS-MIN-BUS PIC 9(3).
		05 WS-MIN-WAIT PIC 9(4) VALUE 9999.
	01 WS-STRINGS.
		05 WS-STR-POINTER PIC 9(4) COMP-3 VALUE 1.
		05 WS-I-TEMP PIC 9(3).
		05 WS-I-STRING PIC X(3).
		05 WS-BUS-STRING PIC X(3).
		05 WS-EQ-STRING PIC A(20).
		05 WS-URL-STRING PIC A(300).
	01 WS-WAIT PIC 9(8).
	01 WS-FORMATTED-NUMBER PIC ZZZZZ.

PROCEDURE DIVISION.
	
	OPEN INPUT InputFile.
		READ InputFile INTO WS-INPUT-LINE
		MOVE WS-INPUT-LINE TO WS-START-TIME
		READ InputFile INTO WS-INPUT-LINE
		MOVE WS-INPUT-LINE TO WS-SCHEDULE
	CLOSE InputFile.
	
	INSPECT WS-SCHEDULE REPLACING FIRST SPACE BY ",".
	INSPECT WS-SCHEDULE TALLYING WS-BUS-COUNT FOR ALL ",".
	
	PERFORM VARYING I FROM 1 BY 1 UNTIL I>WS-BUS-COUNT
		UNSTRING WS-SCHEDULE DELIMITED BY ","
			INTO WS-BUS(I)
			WITH POINTER WS-STR-POINTER
		END-UNSTRING
	END-PERFORM.
	
	PERFORM VARYING I FROM 1 BY 1 UNTIL I>WS-BUS-COUNT
		IF NOT WS-BUS(I)="x"
			MOVE WS-BUS(I) TO WS-CURRENT-BUS
			MOVE 0 TO WS-WAIT
			PERFORM UNTIL WS-WAIT>WS-START-TIME
				ADD WS-CURRENT-BUS TO WS-WAIT
			END-PERFORM
			SUBTRACT WS-START-TIME FROM WS-WAIT
			MOVE WS-WAIT TO WS-TIME(I)
		END-IF
	END-PERFORM.
	
	PERFORM VARYING I FROM 1 BY 1 UNTIL I>WS-BUS-COUNT
		IF NOT WS-BUS(I)="x"
			IF WS-TIME(I)<WS-MIN-WAIT
				MOVE WS-BUS(I) TO WS-MIN-BUS
				MOVE WS-TIME(I) TO WS-MIN-WAIT
			END-IF
		END-IF
	END-PERFORM.
	
	MULTIPLY WS-MIN-BUS BY WS-MIN-WAIT GIVING WS-WAIT.
	MOVE WS-WAIT TO WS-FORMATTED-NUMBER.
	DISPLAY "Part 1 answer: " WS-FORMATTED-NUMBER.
	
	MOVE "https://wolframalpha.com/input?i=" TO WS-URL-STRING.
	
	PERFORM VARYING I FROM 1 BY 1 UNTIL I>WS-BUS-COUNT
		IF NOT WS-BUS(I)="x"
			MOVE SPACES TO WS-EQ-STRING
			MOVE I TO WS-I-TEMP
			SUBTRACT 1 FROM WS-I-TEMP
			MOVE WS-I-TEMP TO WS-I-STRING
			INSPECT WS-I-STRING REPLACING ALL "0" BY SPACE
			IF WS-I-STRING=SPACES
				MOVE "0" TO WS-I-STRING
			END-IF
			MOVE WS-BUS(I) TO WS-BUS-STRING
			STRING
				"(t%2B";
				FUNCTION TRIM(WS-I-STRING);
				")mod";
				FUNCTION TRIM(WS-BUS-STRING);
				"=0,"
				INTO WS-EQ-STRING
			END-STRING
			STRING
				FUNCTION TRIM(WS-URL-STRING);
				FUNCTION TRIM(WS-EQ-STRING);
				INTO WS-URL-STRING
			END-STRING
		END-IF
	END-PERFORM.
	
	DISPLAY "Part 2 answer:"
	DISPLAY FUNCTION TRIM(WS-URL-STRING)
	DISPLAY "The solution is in y=mx+b form, and the answer is b."
	
STOP RUN.
